{"id":54,"date":"2019-01-30T00:23:20","date_gmt":"2019-01-30T00:23:20","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/?page_id=54"},"modified":"2020-07-14T16:53:28","modified_gmt":"2020-07-14T16:53:28","slug":"course","status":"publish","type":"page","link":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/course\/","title":{"rendered":"The Course"},"content":{"rendered":"\n<p>In Spring 2020 our team will offer a course titled &#8220;Imagineernig the Technosphere&#8221; with course codes: DCP4930, DIG4905, CLA3930, MEM3931.<\/p>\n\n\n\n<figure class=\"wp-block-embed-youtube wp-block-embed is-type-video is-provider-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" width=\"525\" height=\"295\" src=\"https:\/\/www.youtube.com\/embed\/ypmaDq060oY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n\n\n\n<pre class=\"wp-block-verse\">Imaginer<br><em>One that imagines.<\/em><br>-Merriam-Webster Dictionary&nbsp;<br><\/pre>\n\n\n\n<pre class=\"wp-block-verse\">Technosphere<br><em>The sphere or realm of human technological activity; <\/em><br><em>the technologically modified environment.<\/em><br>-English Oxford&nbsp;<em>Living<\/em>&nbsp;Dictionaries  <\/pre>\n\n\n\n<p><strong>COURSE DESCRIPTION<\/strong><\/p>\n\n\n\n<p>This multi-disciplinary, team-taught course explores the separation\nbetween nature and culture as humans develop and use technology to imagine and\nmodify the environments they occupy and ultimately create the technosphere\n(past, present, and future). Examining a range of technologies and\ntechnological advances from different time periods and contexts (social,\ncultural, political, etc.), students will gain a better understanding of how\ntechnology has shaped our lives and world. The course will also investigate a\nrange of digital technologies and how they might help us address some of the\nmore pressing problems we face today and in the future. Particular emphasis is\nplaced on the act of understanding, visualizing, conceptualizing, making, and\nshaping our world and the benefits and challenges of technology in the process.<\/p>\n\n\n\n<p> <\/p>\n\n\n\n<p>The purpose of this course is to respond to the grand challenge question: “How do technologies influence our lives, then and now?” from the perspectives of our 6 thematic units: 1) Inventions and Sciences, 2) Spaces and Infrastructure, 3) Past and Future, 4) Imagining and Designing, 5) Conservation and Sustainability, 6) Culture and Society. This interdisciplinary approach will equip the students with foundational knowledge and tangible skills through weekly modules and experiential learning activities that will be organized as part of the <a href=\"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/uf-quest-game\/\">“UF Quest Game”<\/a>, a gamified learning experience specially designed for this course. The students will be able to transcend the boundaries of traditional disciplines and demonstrate how the humanities serve as the foundation for understanding science and technology and how this holistic approach could affect our decision making processes in ourselves, and on a planetary scale.<\/p>\n\n\n\n<p><strong>COURSE PRE-REQUISITES \/ CO-REQUISITES<\/strong><\/p>\n\n\n\n<p>There are no pre- or co-requisites for this course.<\/p>\n\n\n\n<p><strong>COURSE OBJECTIVES<\/strong><\/p>\n\n\n\n<p>At the conclusion of this course, students\nwill be able to:<\/p>\n\n\n\n<ul><li>Transcend the boundaries of traditional disciplines and demonstrate how the humanities serve as the foundation for understanding science and technology.<\/li><li>Explore and possibly redefine humanity as a creature of technology, Homo technos.<\/li><li>Develop a broad view of technology as techne and to blur the boundaries of art, culture, science, and its products.<\/li><li>Reveal the active process of making, fashioning, and designing in landscapes, buildings, social environments, and in ourselves, and on a planetary scale. Students will reconsider the cultural significance of physical constructions from the past and present.<\/li><li>Introduce students to alternative temporalities, different ways that the past, present, and future relate.<\/li><li>Present the contributions of arts and humanities disciplines to interaction design.<\/li><li>Enable students to analyze and evaluate technological human experiences using standard methodologies for interaction design<\/li><\/ul>\n\n\n\n<p><strong>THE UF QUEST GAME<\/strong><\/p>\n\n\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn the beginning of the semester each student will be\ngiven a box with the UF Quest Game, a specially designed learning experience\nthat will be used in each module of this course. Using an old aerial photograph\nof the UF campus as a map and a GPS app as a guide, students and faculty engage\nin a unique adventure through space and time. This time travel can be used as\nan experiential learning tool that moves the student outside of the traditional\nclassroom setting to explore how humans use technology to alter our physical\nworld. During this journey students can discover what the lessons of the past\ninventions can teach us about how to address the problems facing humanity\ntoday, particularly as they emerge in the “technosphere,” the landscape shaped\nby the human hands.\n\n\n\n<\/p>\n\n\n\n<p><strong>SYLLABUS<\/strong><\/p>\n\n\n\n<p>The full syllabus of the course &#8220;Imagineering the Technosphere&#8221; is available at the following link: <a href=\"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/Technosphere_Spring2020_SyllabusV1.2_AB.pdf\">https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/Technosphere_Spring2020_SyllabusV1.2_AB.pdf<\/a><\/p>\n\n\n\n<p><strong>COURSE WEB-SITE<\/strong><\/p>\n\n\n\n<p>More information about this course can be found at the web-site of the course at the official learning management system of the University of Florida (Canvas) at: <a href=\"https:\/\/elearning.ufl.edu\">https:\/\/elearning.ufl.edu<\/a><\/p>\n\n\n\n<p><strong>AFFORDABLE UF INITIATIVE<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"239\" height=\"291\" src=\"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/wp-content\/uploads\/2020\/07\/affordable_uf.jpg\" alt=\"\" class=\"wp-image-413\"\/><\/figure>\n\n\n\n<p>Our course was awarded a 2020 Affordable UF Badge as a recognition of our commitment to affordable education. By producing on our own the materials of this course, including the UF Quest Game,  its 3D printed parts,  and the associated mobile app we managed to reduce the cost  of course materials to less than $20 per credit hour, which is the designated limit of the affordable UF initiative. Through our efforts we made it possible for all of our students to access the resources they needed to be successful in your course. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>In Spring 2020 our team will offer a course titled &#8220;Imagineernig the Technosphere&#8221; with course codes: DCP4930, DIG4905, CLA3930, MEM3931. ImaginerOne that imagines.-Merriam-Webster Dictionary&nbsp; TechnosphereThe sphere or realm of human technological activity; the technologically modified environment.-English Oxford&nbsp;Living&nbsp;Dictionaries COURSE DESCRIPTION This multi-disciplinary, team-taught course explores the separation between nature and culture as humans develop and use &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/course\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;The Course&#8221;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/pages\/54"}],"collection":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/comments?post=54"}],"version-history":[{"count":13,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/pages\/54\/revisions"}],"predecessor-version":[{"id":414,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/pages\/54\/revisions\/414"}],"wp:attachment":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/media?parent=54"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}