{"id":317,"date":"2019-09-12T19:24:40","date_gmt":"2019-09-12T19:24:40","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/?p=317"},"modified":"2019-09-12T19:25:14","modified_gmt":"2019-09-12T19:25:14","slug":"andrew-jenkins","status":"publish","type":"post","link":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/2019\/09\/12\/andrew-jenkins\/","title":{"rendered":"Andrew Jenkins"},"content":{"rendered":"\n<p>The Technosphere working group’s “How\nhave technologies shaped our lives, and how do we draw on them to meet 21st\ncentury challenges?” grand challenge question invites inquiries into the ways\nthat technology channels human perception and forms practices.&nbsp; My research interests run along parallel\nrails by seeking to read the texts of Margaret Fuller, Ralph Waldo\nEmerson, Henry David Thoreau, and Emily Dickinson through the lens of\nnineteenth-century science and visual culture.&nbsp;\nMy project focuses on astronomy and the profusion of\ntelescopically-mediated stellar figures these authors borrow, alter, and\ninvent.&nbsp; As science challenged\nestablished discourses like religion for authority, the public was left to\namalgamate new and disturbing information—magnitudes greater voids in the\ncosmos unveiled by stellar parallax, an invisible planet (Neptune) lurking at\nthe edge of our own solar system discovered via the new method of statistical\nprediction, and monstrous shapes emerging from the nebulae like the one in\nOrion.&nbsp; The cultural work of basic\nmetaphors like orientation, centrality, spheres of influence, and concepts like\n‘heaven’ came under pressure.&nbsp; This group\nof authors, as a result, sought to work through and use these new ways of\nseeing and thinking about the cosmos in what can now be recognized as a type of\nprehistory to our own Hubble-inflected relationship to the unseen totality of\nthe known universe.<\/p>\n\n\n\n<p>Conference paper accepted at the 2019 Society for Literature, Science, and the Arts conference in Irvine, CA, November 2019.&nbsp; Conference website: <a href=\"https:\/\/litsciarts.org\/slsa19\/\">https:\/\/litsciarts.org\/slsa19\/<\/a> <\/p>\n\n\n\n<p>Conference paper abstract: <\/p>\n\n\n\n<p><strong>“Starry Ether and Nebulous Transcendence: Ralph Waldo Emerson’s Scientific Vision in Poems”<\/strong><\/p>\n\n\n\n<p>In responding to the ways in which speculative practices tangle with utopic, communitarian, and transcendental ideals, my proposed conference paper will address Ralph Waldo Emerson’s engagement with optics and astronomy in his first volume of poetry in 1847. The paper draws upon a dissertation chapter in which I contend Emerson goes beyond just casual allusion to and incorporation of concepts drawn from astronomy and optics and instead offers a causal theory that points to a material process of transcendental inspiration akin to spiritualism’s use of the ether as a basis for ‘contact’ with departed souls later in the century (cf. Moffet’s “Swept Over an Etheric Niagara” JLS 2015). I balance this abstracted theory against its practice, particularly a passage from his journals in which Emerson laments his inability to make direct contact with his “holy fraternity” of friends leading him to state “But so the remoter stars seem a nebula of united light, yet there is no group which a telescope will not resolve: And the dearest friends are separated by irreconcilable intervals,” a sentiment that stipulates the necessity for a connecting medium. In proposing a mechanism for his utopic form of individual, momentary transcendence—by no means permanent with the fleeting instances of revolutionary inspiration zapped from mind to mind and spirit to spirit (cf. Mastroianni’s “Moods and the Secret Cause of Revolution in Emerson” chapter of Politics and Skepticism in Antebellum American Literature)—Emerson is attempting to co-opt popular excitement surrounding astronomy’s nineteenth-century discoveries by offering a genre- and natural history-inflected version of the inductive method and in the process reclaims literature’s constitutive function in public meaning-making.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Technosphere working group’s “How have technologies shaped our lives, and how do we draw on them to meet 21st century challenges?” grand challenge question invites inquiries into the ways that technology channels human perception and forms practices.&nbsp; My research interests run along parallel rails by seeking to read the texts of Margaret Fuller, Ralph &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/2019\/09\/12\/andrew-jenkins\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Andrew Jenkins&#8221;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[7],"tags":[],"_links":{"self":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/posts\/317"}],"collection":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/comments?post=317"}],"version-history":[{"count":2,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/posts\/317\/revisions"}],"predecessor-version":[{"id":319,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/posts\/317\/revisions\/319"}],"wp:attachment":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/media?parent=317"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/categories?post=317"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/technosphere\/index.php\/wp-json\/wp\/v2\/tags?post=317"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}